docs/notes/nixos-to-gentoo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>From NixOS to Gentoo</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" /> <link rel="stylesheet" href="../assets/style.css" /> 
</head>
<body>
<div id="preamble" class="status">
<div id=bar><a href=../index.html>Index</a></div>
</div>
<div id="content" class="content">
<h1 class="title">From NixOS to Gentoo</h1>

<div id="outline-container-orgd2aea84" class="outline-2">
<h2 id="orgd2aea84">Intro</h2>
<div class="outline-text-2" id="text-orgd2aea84">
<p>
Before I go over my reasons for leaving NixOS for Gentoo I want to start by
talking a bit about my history with GNU/Linux.
</p>

<p>
The first time I used GNU/Linux was back in 1996 when I installed Red Hat
Linux on my grandfathers PC. A year or so later I was doing a school
internship at a local IT department, and one of the employees handed me a
Debian CD. I then spent a couple of years on Debian before eventually finding
<a href="https://www.gentoo.org/">Gentoo</a>.
</p>

<p>
My first Gentoo install took me about 2 days, partly because I had no
developer experience back then and so a lot of the inner workings of Gentoo
were foreign to me and compiling everything from a stage1 tarball on whatever
shitty hardware I had back then was pretty time consuming. Then around 2018
I found NixOS as it was pretty popular in the Haskell community, a language I
had recently fallen in love with. NixOS felt like the perfect OS, it reminded
me of Gentoo in that it was source based and had similar control through
overrides but with binary caches for when you just wanted to use the
defaults.
</p>
</div>
</div>

<div id="outline-container-orgab3e9f5" class="outline-2">
<h2 id="orgab3e9f5">Why NixOS is great</h2>
<div class="outline-text-2" id="text-orgab3e9f5">
<p>
NixOS does a lot of things well. Your entire system is expressed in a
declarative fashion, this includes all your packages and services with their
respective configurations, drivers etc.
</p>

<p>
NixOS also gives you a near unbreakable system with atomic upgrades and
rollbacks. Every time you rebuild your system nix will build everything to
the nix-store and then run an activation script to symlink everything into
<code>/run/current-system</code>. The beauty of this is that every time you rebuild it's
as if you did a clean install. You can even take this one step further by
<a href="https://grahamc.com/blog/erase-your-darlings">mounting your root partitionon a Temporary File System (tmpfs)</a>.
</p>
</div>
</div>

<div id="outline-container-org4f697f6" class="outline-2">
<h2 id="org4f697f6">Why I left NixOS</h2>
<div class="outline-text-2" id="text-org4f697f6">
<p>
All the things that makes NixOS great comes at a cost which caused me to
eventually leave it behind. The immutability of NixOS means that while most
things works flawlessly there are a few instances when software will not work
all that great due to NixOS not following the <a href="https://en.wikipedia.org/wiki/Filesystem_Hierarchy_Standard">Filesystem Heirarchy Standard
(FHS)</a>, although there are workarounds for this issue nowadays. I recently
ran into this problem when I wanted to do some Common Lisp development,
quicklisp, the package manager used for Common Lisp does not work well.
Browsers like <a href="https://nyxt.atlas.engineer/">Nyxt</a> which is written in Common Lisp has been broken on NixOS
for as long as I can remember.
</p>

<p>
Once you get hooked on NixOS you tend to want everything to be managed by Nix
which means that every time you configure some software you need to write
this configuration to the nix store and wrap your binary to use that config.
This means that every time you want to change some configuration you need to
rebuild your OS, this may not be a problem if you rarely change stuff but I
ended up finding it annoying. An alternative approach is to use Home-Manager
but I personally didn't feel like adding yet another layer of abstraction
onto my system.
</p>

<p>
NixOS abstracting everything away can be amazing but ultimately I realized
it's not what I want, as a long time GNU/Linux geek I didn't like how it
caused me to forget how to operate a GNU/Linux system.
</p>
</div>
</div>

<div id="outline-container-orgfcf0658" class="outline-2">
<h2 id="orgfcf0658">Why Gentoo</h2>
<div class="outline-text-2" id="text-orgfcf0658">
<p>
Gentoo has always had a special place in my heart and so when decided to pick
up another distro, Gentoo was a no-brainer for me as any other distro would
have been a step backwards in terms of control.
</p>
</div>
</div>

<div id="outline-container-org4517dbb" class="outline-2">
<h2 id="org4517dbb">Conclusion</h2>
<div class="outline-text-2" id="text-org4517dbb">
<p>
I've been back on Gentoo for a while now and so far it has been great!
Portage seems to have improved a fair bit and I feel it's a bit simpler while
maintaining the same level of control. I've also written a few packages for
my local repo and I would say it's about as straight forward as it is to
write nix packages. Overall I'm very happy to be back on Gentoo after all these years.
</p>

<p>
I still think using Nix is the sanest way to manage project dependencies and
achieve reproducible builds and I assume I will keep using it for projects on
Gentoo.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator">Generated with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.0.60 and <a href="https://orgmode.org">Org</a> mode 9.6.1</p>
</div>
</body>
</html>